FKDD_COPY_DIFF_3_2026-02-13/Reports/ПланФактныйАнализ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПланФактныйАнализ</Name>
			<Comment>План-фактный анализ</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеПоляВОтдельнойКолонке</Name>
					<Comment>Выводить дополнительные группировок в отдельной колонке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Comment>Имя регистра для запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Comment>Объект формирования отчета</Comment>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНастройки</Name>
					<Comment>Режим настройки отчета: стандарт, эксперт</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыНастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыИзмеренийСтрок</Name>
					<Comment>Параметры измерений строк</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтоотступ</Name>
					<Comment>Истина - использовать автоотступ при выводе отчета, Ложь - не использовать автоотступ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования показателя</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматнаяСтрока</Name>
							<Comment>Форматная строка отображения показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Положение</Name>
							<Comment>Положение показателя в табличном документе</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ПоложенияПоказателяТабличногоДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Comment>Ширина колонки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Функции</Name>
					<Comment>Функции отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования функции</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияСтроки</Name>
					<Comment>Таблица измерений строк отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования измерения строки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление измерения строки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>Тип измерения строки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияКолонки</Name>
					<Comment>Таблица измерений колонок отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования измерения колонки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление измерения колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>Тип измерения колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Reports/ПланФактныйАнализ/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	//ПолеОтбора=ПостроительОтчета.Отбор.Добавить("Менеджер","Менеджер","Менеджер");
	//ПолеОтбора.ВидСравнения=ВидСравнения.Равно;
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт

	// Заменим представления, если установлен отбор по виду плана.
	ВернутьПотомВсеОбратно = Ложь;
	ЭлементОтбора = ПостроительОтчета.Отбор.Найти("ВидПланаКомпании");
	Если (ЭлементОтбора<>Неопределено) И (ЭлементОтбора.Использование) И (ЭлементОтбора.ВидСравнения=ВидСравнения.Равно) И (НЕ ЭлементОтбора.Значение.ЭтоГруппа) Тогда
		ВернутьПотомВсеОбратно = Истина;
		ВидПлана = ЭлементОтбора.Значение;
		
		// Меняем представления измерений строки.
		Если НЕ ВидПлана.ВидАналитикиПланирования1.Пустая() Тогда
			ИзмерениеВидАналитики = ИзмеренияСтроки.Найти("ВидАналитикиПланирования1", "ПутьКДанным");
			Если (ИзмерениеВидАналитики<>Неопределено) И (ИзмерениеВидАналитики.Использование) Тогда
				ИзмерениеВидАналитики.Представление = "" + ВидПлана.ВидАналитикиПланирования1;	
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВидПлана.ВидАналитикиПланирования2.Пустая() Тогда
			ИзмерениеВидАналитики = ИзмеренияСтроки.Найти("ВидАналитикиПланирования2", "ПутьКДанным");
			Если (ИзмерениеВидАналитики<>Неопределено) И (ИзмерениеВидАналитики.Использование) Тогда
				ИзмерениеВидАналитики.Представление = "" + ВидПлана.ВидАналитикиПланирования2;	
			КонецЕсли;
		КонецЕсли;
		
		// Теперь показатели.
		Если НЕ ПустаяСтрока(ВидПлана.ПоказательПлана1) Тогда
			Показатель = Показатели.Найти("ПоказательПлана1", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана1 + " (План)";
			
			Показатель = Показатели.Найти("ПоказательФакта1", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана1 + " (Факт)";	
			
			Показатель = Показатели.Найти("Показатель1Разница", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана1 + " (Отклонение)";
			
			Показатель = Показатели.Найти("Показатель1РазницаПроцент", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана1 + " (Отклонение в %)";
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ВидПлана.ПоказательПлана2) Тогда
			Показатель = Показатели.Найти("ПоказательПлана2", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана2 + " (План)";
			
			Показатель = Показатели.Найти("ПоказательФакта2", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана2 + " (Факт)";	
			
			Показатель = Показатели.Найти("Показатель2Разница", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана2 + " (Отклонение)";
			
			Показатель = Показатели.Найти("Показатель2РазницаПроцент", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана2 + " (Отклонение в %)";
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ВидПлана.ПоказательПлана3) Тогда
			Показатель = Показатели.Найти("ПоказательПлана3", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана3 + " (План)";
			
			Показатель = Показатели.Найти("ПоказательФакта3", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана3 + " (Факт)";	
			
			Показатель = Показатели.Найти("Показатель3Разница", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана3 + " (Отклонение)";
			
			Показатель = Показатели.Найти("Показатель3РазницаПроцент", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана3 + " (Отклонение в %)";
		КонецЕсли;				
	Конецесли;
			
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат,, глПрава);
	
	Если ВернутьПотомВсеОбратно Тогда
		// Сменим представления обратно.	
		ИзмерениеВидАналитики = ИзмеренияСтроки.Найти("ВидАналитикиПланирования1", "ПутьКДанным");
		Если (ИзмерениеВидАналитики<>Неопределено) И (ИзмерениеВидАналитики.Использование) Тогда
			ИзмерениеВидАналитики.Представление = "Вид аналитики планирования 1";	
		КонецЕсли;
		ИзмерениеВидАналитики = ИзмеренияСтроки.Найти("ВидАналитикиПланирования2", "ПутьКДанным");
		Если (ИзмерениеВидАналитики<>Неопределено) И (ИзмерениеВидАналитики.Использование) Тогда
			ИзмерениеВидАналитики.Представление = "Вид аналитики планирования 2";	
		КонецЕсли;
		
		
		Показатель = Показатели.Найти("ПоказательПлана1", "Имя");			
		Показатель.Представление = "Показатель плана 1";
		
		Показатель = Показатели.Найти("ПоказательФакта1", "Имя");			
		Показатель.Представление = "Показатель факта 1";
		
		Показатель = Показатели.Найти("Показатель1Разница", "Имя");			
		Показатель.Представление = "Показатель 1 (Отклонение)";
		
		Показатель = Показатели.Найти("Показатель1РазницаПроцент", "Имя");			
		Показатель.Представление = "Показатель 1 (Отклонение в %)";
		
		Показатель = Показатели.Найти("ПоказательПлана2", "Имя");			
		Показатель.Представление = "Показатель плана 2";
		
		Показатель = Показатели.Найти("ПоказательФакта2", "Имя");			
		Показатель.Представление = "Показатель факта 2";
		
		Показатель = Показатели.Найти("Показатель2Разница", "Имя");			
		Показатель.Представление = "Показатель 2 (Отклонение)";
		
		Показатель = Показатели.Найти("Показатель2РазницаПроцент", "Имя");			
		Показатель.Представление = "Показатель 2 (Отклонение в %)";
		
		Показатель = Показатели.Найти("ПоказательПлана3", "Имя");			
		Показатель.Представление = "Показатель плана 3";
		
		Показатель = Показатели.Найти("ПоказательФакта3", "Имя");			
		Показатель.Представление = "Показатель факта 3";
		
		Показатель = Показатели.Найти("Показатель3Разница", "Имя");			
		Показатель.Представление = "Показатель 3 (Отклонение)";
		
		Показатель = Показатели.Найти("Показатель3РазницаПроцент", "Имя");			
		Показатель.Представление = "Показатель 3 (Отклонение в %)";
	КонецЕсли;  

	Возврат Результат;
КонецФункции // ЗаполнитьНачальныеНастройки()

// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура
//
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ИмяРегистра = "Продажи";
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
#КонецЕсли
